Revit 2027 API
ParameterTypeId.AnalyticalDefineThermalPropertiesBy Property
 "Define Thermal Properties by"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalDefineThermalPropertiesBy { get; }
Public Shared ReadOnly Property AnalyticalDefineThermalPropertiesBy As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalDefineThermalPropertiesBy {
	ForgeTypeId^ get ();
}
static member AnalyticalDefineThermalPropertiesBy : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace